In [12]:
import pandas as pd
import os

In [13]:
root_dir = os.path.dirname(os.getcwd())
print(root_dir)
data_dir = os.path.join(root_dir, 'data')
print(data_dir)
json_data_path = data_dir+"\employees.json"
print(json_data_path)

C:\Users\Asus\PycharmProjects\Pandas_Fundamentals
C:\Users\Asus\PycharmProjects\Pandas_Fundamentals\data
C:\Users\Asus\PycharmProjects\Pandas_Fundamentals\data\employees.json

In [14]:
"""Read Data from JSON file"""
df = pd.read_json(json_data_path)
df

   EmployeeID     Name   Department  Age  Salary    JoinDate
0         101    Alice  Engineering   29   99000  2020-01-15
1         102      Bob        Sales   34   65000  2018-03-22
2         103  Charlie    Marketing   28   70000  2019-11-10
3         104    David  Engineering   42   95000  2015-06-01
4         105      Eva        Sales   30   62000  2021-09-15
5         106    Frank           HR   45   98000  2012-04-17
6         107    Grace  Engineering   26   82000  2022-05-12
7         108   Hannah           HR   39   59000  2017-12-05
8         109      Ian    Marketing   35   73000  2021-08-19
9         110     Jack        Sales   31   67000  2020-02-28

In [15]:
"""Sorting Json Data"""
sorted_df = df.sort_values(by=['Department', 'Salary'], ascending=[True, False])
sorted_df

   EmployeeID     Name   Department  Age  Salary    JoinDate
0         101    Alice  Engineering   29   99000  2020-01-15
3         104    David  Engineering   42   95000  2015-06-01
6         107    Grace  Engineering   26   82000  2022-05-12
5         106    Frank           HR   45   98000  2012-04-17
7         108   Hannah           HR   39   59000  2017-12-05
8         109      Ian    Marketing   35   73000  2021-08-19
2         103  Charlie    Marketing   28   70000  2019-11-10
9         110     Jack        Sales   31   67000  2020-02-28
1         102      Bob        Sales   34   65000  2018-03-22
4         105      Eva        Sales   30   62000  2021-09-15

In [16]:
"""
 - Feature Engineering: Each Column called feature
 - Example: Each row called example
"""

'\n - Feature Engineering: Each Column called feature\n - Example: Each row called example\n'

In [17]:
"""Filtered by Column"""

new_df = df[['Name', 'Salary']]
new_df

      Name  Salary
0    Alice   99000
1      Bob   65000
2  Charlie   70000
3    David   95000
4      Eva   62000
5    Frank   98000
6    Grace   82000
7   Hannah   59000
8      Ian   73000
9     Jack   67000

In [18]:
"""Filtered by Row"""
new_df =  df[df['Department'] == "Engineering"]
new_df

   EmployeeID   Name   Department  Age  Salary    JoinDate
0         101  Alice  Engineering   29   99000  2020-01-15
3         104  David  Engineering   42   95000  2015-06-01
6         107  Grace  Engineering   26   82000  2022-05-12

In [19]:
"""Multiples mask"""
department_mask = df['Department'] == "Engineering"
age_mask = df['Age'] < 40
new_mask = df[department_mask & age_mask]
new_mask

   EmployeeID   Name   Department  Age  Salary    JoinDate
0         101  Alice  Engineering   29   99000  2020-01-15
6         107  Grace  Engineering   26   82000  2022-05-12

In [20]:
"""Creating a new Column"""
df['bonus'] = df['Salary'] * .5
new_df = df[['Name', 'Salary', 'bonus']]
new_df

      Name  Salary    bonus
0    Alice   99000  49500.0
1      Bob   65000  32500.0
2  Charlie   70000  35000.0
3    David   95000  47500.0
4      Eva   62000  31000.0
5    Frank   98000  49000.0
6    Grace   82000  41000.0
7   Hannah   59000  29500.0
8      Ian   73000  36500.0
9     Jack   67000  33500.0

In [21]:
"""Query"""
name_df = df.query(
    'Name == "Alice"'
)
print(name_df)

   EmployeeID   Name   Department  Age  Salary    JoinDate    bonus
0         101  Alice  Engineering   29   99000  2020-01-15  49500.0

In [22]:
bonus_df = df.query(
    'bonus > 40000'
)
print(bonus_df)

   EmployeeID   Name   Department  Age  Salary    JoinDate    bonus
0         101  Alice  Engineering   29   99000  2020-01-15  49500.0
3         104  David  Engineering   42   95000  2015-06-01  47500.0
5         106  Frank           HR   45   98000  2012-04-17  49000.0
6         107  Grace  Engineering   26   82000  2022-05-12  41000.0

In [23]:
bonus_df.set_index('EmployeeID', inplace=True)
print(bonus_df)

             Name   Department  Age  Salary    JoinDate    bonus
EmployeeID
101         Alice  Engineering   29   99000  2020-01-15  49500.0
104         David  Engineering   42   95000  2015-06-01  47500.0
106         Frank           HR   45   98000  2012-04-17  49000.0
107         Grace  Engineering   26   82000  2022-05-12  41000.0